In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

### Data Merging

In [4]:
data_1={
    "id" : [1, 2, 3, 4],
    "name" : ["Alice", "Bob", "Charlie", "David"],
    "age" : [25, 30, 35, 40]
        
}
df1 = pd.DataFrame(data_1)
df1.head()

   id     name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

In [5]:
data_2={
    "id" : [1, 2, 3, 5],
    "city" : ["New York", "Los Angeles", "Chicago", "Houston"],
    "salary" : [70000, 80000, 60000, 90000]
}
df2 = pd.DataFrame(data_2)
df2.head()

   id         city  salary
0   1     New York   70000
1   2  Los Angeles   80000
2   3      Chicago   60000
3   5      Houston   90000

In [7]:
merge = pd.merge(df1,df2, on = "id", how = "inner")
merge.head()

   id     name  age         city  salary
0   1    Alice   25     New York   70000
1   2      Bob   30  Los Angeles   80000
2   3  Charlie   35      Chicago   60000

## Concatenation

In [9]:
import pandas as pd

# DataFrame 1
df1 = pd.DataFrame({
    'Name': ['Ali', 'Sara'],
    'Age': [22, 25]
})

# DataFrame 2
df2 = pd.DataFrame({
    'Name': ['John', 'Zara'],
    'Age': [30, 27]
})

# Concatenate by rows (axis=0)
result_rows = pd.concat([df1, df2], axis=0)

print("Concatenated by Rows:")
print(result_rows)

Concatenated by Rows:
   Name  Age
0   Ali   22
1  Sara   25
0  John   30
1  Zara   27

In [10]:
# DataFrame 1
df3 = pd.DataFrame({
    'Name': ['Ali', 'Sara']
})

# DataFrame 2
df4 = pd.DataFrame({
    'Age': [22, 25]
})

# Concatenate by columns (axis=1)
result_columns = pd.concat([df3, df4], axis=1)

print("\nConcatenated by Columns:")
print(result_columns)

Concatenated by Columns:
   Name  Age
0   Ali   22
1  Sara   25